In [17]:
import numpy as np
import pandas as pd

# Section 5: Basic Data Manipulation (41-60)

**41. Add a new column: DataFrame mein ek 'Salary' column add karein aur sabhi rows ke liye
value 50000 set karein.**

In [18]:
data = {
    'Name': ['Amit', 'Priya', 'Raj', 'Sneha', 'Karan', 'Meera'],
    'Age': [23, 25, 21, 22, 24, 26],
    'City': ['Delhi', 'Mumbai', 'Kolkata', 'Chennai', 'Pune', 'Jaipur']
}
df = pd.DataFrame(data)

In [19]:
df

    Name  Age     City
0   Amit   23    Delhi
1  Priya   25   Mumbai
2    Raj   21  Kolkata
3  Sneha   22  Chennai
4  Karan   24     Pune
5  Meera   26   Jaipur

In [ ]:
Salary = [65000,65000,65000,65000,65000,65000]

In [26]:
df2 =[ pd.DataFrame(data),(Columns=Salary)]

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (710281196.py, line 1)

TypeError: list indices must be integers or slices, not list